JuneJulyAugust/openotter/firmware/stm32-mcp/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ble_app.h"
#include "ble_tof.h"
#include "stm32l4xx_ll_pwr.h"
#include "stm32l4xx_ll_rcc.h"
#include "tof_l1.h"
#include "tof_l5.h"
#include "firmware_watchdog.h"
#include "firmware_stack_guard.h"
#include "firmware_panic.h"
#include "firmware_mpu.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c2;
I2C_HandleTypeDef hi2c3;

QSPI_HandleTypeDef hqspi;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_I2C2_Init(void);
static void MX_I2C3_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */
  __HAL_RCC_PWR_CLK_ENABLE();

  /*
   * Reset the RTC backup domain on pin-reset so stale RTC wakeup state
   * from a previous run cannot hang the Timer Server initialization.
   * This matches the reference P2P_LedButton example.
   */
  if (LL_RCC_IsActiveFlag_PINRST() != RESET) {
    LL_PWR_ClearFlag_SB();
    HAL_PWR_EnableBkUpAccess();
    HAL_PWR_EnableBkUpAccess();
    LL_RCC_ForceBackupDomainReset();
    __HAL_RCC_CLEAR_RESET_FLAGS();
    LL_RCC_ReleaseBackupDomainReset();
  }
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DFSDM1_Init();
  MX_I2C2_Init();
  MX_I2C3_Init();
  MX_QUADSPI_Init();
  /* SPI3 is owned by the BLE middleware (hw_spi.c) — do NOT init here */
  MX_TIM3_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  /* USER CODE BEGIN 2 */
  /* LD1 (PA5) heartbeat LED */
  {
    GPIO_InitTypeDef led = {0};
    led.Pin = GPIO_PIN_5;
    led.Mode = GPIO_MODE_OUTPUT_PP;
    led.Pull = GPIO_NOPULL;
    led.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &led);
  }

  /* Start TIM3 PWM on CH1 (throttle PB4) and CH4 (steering PB1) */
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

  /* VL53L1CB stays available for the existing reverse-safety path. VL53L5CX is
   * initialized lazily from the BLE debug config path so a cold MSP01 power-up
   * cannot block BLE advertising or the heartbeat LED before the main loop.
   */
  TofL1_Init();

  /* Initialize BLE stack and custom GATT service */
  BLE_App_Init(&htim3);

  /* Register the ToF GATT service (FE60). Must follow BLE_App_Init so the
   * BlueNRG stack and SVCCTL are already up. */
  BLE_Tof_Init();

  /* Stamp the stack-bottom sentinel BEFORE the main loop starts pushing
   * frames. If recursion or a deep call chain ever overwrites it, the
   * check below catches the corruption before it manifests as something
   * harder to triage. */
  FwStackGuard_Init();

  /* Configure the MPU's hardware no-access region immediately below the
   * stack sentinel. Any push past the configured stack bottom traps as
   * MemManage on the offending instruction; the sentinel remains readable
   * for the cheap main-loop backup check below. */
  FwMpu_Init();

  /* Start the independent watchdog after fast startup init paths have run.
   * The window is sized to tolerate lazy VL53L5CX boot from the main loop.
   * From this point on, any main-loop iteration that exceeds the watchdog
   * window reboots the chip — last-resort recovery from a hung BLE stack,
   * blocked I²C transaction, or any other stuck-loop bug. */
  FwWatchdog_Init();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
    /* Refresh the watchdog at the top of every iteration. If we never get
     * back here (e.g. BLE_App_Process or TofL5_Process spins forever), the
     * IWDG fires after its configured window and resets the chip. */
    FwWatchdog_Refresh();

